[GraphicalObject]
Name=fld
Path=diagtop
PosStyle=VARIABLE
WndStyle=
x= 0
y= 0
width=510
height= 220
Set0="BMP.dgfld|dgChangeDiagHelpIndex INSTPANEL| "
Rc-DLL=hpleo008.dll

[ToolDescriptor]
1=gototop    ,  PUSHBUTTON ,hpgbut02.dll
2=logbook    ,  IMAGESET   ,hpgbut02.dll
3=temp       ,  IMAGESET   ,hpgbut02.dll
4=method     ,  IMAGESET   ,hpgbut02.dll
5=flashlamp  ,  IMAGESET   ,hpgbut02.dll
6=excitassy  ,  IMAGESET   ,hpgbut02.dll
7=emissassy  ,  IMAGESET   ,hpgbut02.dll
8=flowcell   ,  IMAGESET   ,hpgbut02.dll
9=pmt        ,  IMAGESET   ,hpgbut02.dll
10=refdiode  ,  IMAGESET   ,hpgbut02.dll
11=prep      ,  PUSHBUTTON ,hpgbut02.dll


[PUSHBUTTON gototop]
x=4
y=4
width=50
height=43
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList= BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top
Command=dgGotoTopLevel fld
Help=機器パネルのトップレベルへの切替


[IMAGESET logbook]
x=455
y=9
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|@view.floatingmenu "DiagGuiReg[4]", "FLDlogbook"|蛍光検出器ログブック
set1= BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|@view.floatingmenu "DiagGuiReg[4]", "FLDlogbook"|蛍光検出器ログブック
Cursor=CUR...\..\LC\800\HAND1
Help=""


[IMAGESET temp]
x=455
y=109
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|@view.floatingmenu "DiagGuiReg[4]", "FLDtemp"|蛍光検出器温度
set1= BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|@view.floatingmenu "DiagGuiReg[4]", "FLDtemp"|蛍光検出器温度
Cursor=CUR...\..\LC\800\HAND1
Help=""

[IMAGESET method]
x=455
y=59
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|@view.floatingmenu "DiagGuiReg[4]", "FLDmethod"|蛍光検出器メソッド
set1= BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|@view.floatingmenu "DiagGuiReg[4]", "FLDmethod"|蛍光検出器メソッド
Cursor=CUR...\..\LC\800\HAND1
Help=""

[IMAGESET flashlamp]
x=118
y=2
width=50
height=104
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgflshl1|BMP.dgflshl1|BMP.dgflshl1|@view.floatingmenu "DiagGuiReg[4]", "FLDflashlamp"|蛍光検出器フラッシュ ランプ
set1= BMP.dgflshl2|BMP.dgflshl2|BMP.dgflshl2|@view.floatingmenu "DiagGuiReg[4]", "FLDflashlamp"|蛍光検出器フラッシュ ランプ
Cursor=CUR...\..\LC\800\HAND1
Help=

[IMAGESET excitassy]
x=30
y=130
width=60
height=62
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgexcit1|BMP.dgexcit1|BMP.dgexcit1|@view.floatingmenu "DiagGuiReg[4]", "FLDExcitAssy"|蛍光検出器励起アセンブリ
set1= BMP.dgexcit2|BMP.dgexcit2|BMP.dgexcit2|@view.floatingmenu "DiagGuiReg[4]", "FLDExcitAssy"|蛍光検出器励起アセンブリ
Cursor=CUR...\..\LC\800\HAND1
Help=

[IMAGESET emissassy]
x=231
y=6
width=60
height=61
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgemiss1|BMP.dgemiss1|BMP.dgemiss1|@view.floatingmenu "DiagGuiReg[4]", "FLDEmissAssy"|蛍光検出器蛍光アセンブリ
set1= BMP.dgemiss2|BMP.dgemiss2|BMP.dgemiss2|@view.floatingmenu "DiagGuiReg[4]", "FLDEmissAssy"|蛍光検出器蛍光アセンブリ
Cursor=CUR...\..\LC\800\HAND1
Help=

[IMAGESET flowcell]
x=243
y=152
width=36
height=49
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgfldfc1|BMP.dgfldfc1|BMP.dgfldfc1|@view.floatingmenu "DiagGuiReg[4]", "FLDflowcell"|蛍光検出器フロー セル
set1= BMP.dgfldfc2|BMP.dgfldfc2|BMP.dgfldfc2|@view.floatingmenu "DiagGuiReg[4]", "FLDflowcell"|蛍光検出器フロー セル
Cursor=CUR...\..\LC\800\HAND1
Help=

[IMAGESET grating]
x=289
y=53
width=19
height=65
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dggrat01|BMP.dggrat01|BMP.dggrat01|@view.floatingmenu "DiagGuiReg[4]", "FLDgrating"|蛍光検出器グレーティング アセンブリ
set1= BMP.dggrat02|BMP.dggrat02|BMP.dggrat02|@view.floatingmenu "DiagGuiReg[4]", "FLDgrating"|蛍光検出器グレーティング アセンブリ
Cursor=CUR...\..\LC\800\HAND1
Help=

[IMAGESET pmt]
x=386
y=11
width=27
height=68
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgpmt01|BMP.dgpmt01|BMP.dgpmt01|@view.floatingmenu "DiagGuiReg[4]", "FLDpmt"|蛍光検出器フォト マルチプライヤ チューブ
set1= BMP.dgpmt02|BMP.dgpmt02|BMP.dgpmt02|@view.floatingmenu "DiagGuiReg[4]", "FLDpmt"|蛍光検出器フォト マルチプライヤ チューブ
Cursor=CUR...\..\LC\800\HAND1
Help=

[IMAGESET refdiode]
x=362
y=154
width=27
height=42
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgrdiod1|BMP.dgrdiod1|BMP.dgrdiod1|@view.floatingmenu "DiagGuiReg[4]", "FLDRefDiode"|蛍光検出器リファレンス ダイオード
set1= BMP.dgrdiod2|BMP.dgrdiod2|BMP.dgrdiod2|@view.floatingmenu "DiagGuiReg[4]", "FLDRefDiode"|蛍光検出器リファレンス ダイオード
Cursor=CUR...\..\LC\800\HAND1
Help=

[PUSHBUTTON prep]
x=425
y=10
width=15
height=15
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList= RBMP.balance|RBMP.balance|RBMP.balance_gray
Command=dgFLDTurnOnOrBalance
Help=クリックで、バランスをかけるかランプをオンにします。
